## Exercises I
Run python -m pip install pymysql from your terminal to install pymysql.

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
2. cd into your exercises folder for this module and run echo env.py >> .gitignore
3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [6]:
def get_db_url(username, hostname, password, database):
    return f'mysql+pymysql://{username}:{password}@{hostname}/{database}'

4. Use your function to obtain a connection to the employees database.

In [27]:
import pandas as pd
import numpy as np
from env import hostname, username, password
url = get_db_url(username, hostname, password, 'employees')

In [20]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

5. Once you have successfully run a query:

    a. Intentionally make a typo in the database url. What kind of error message do you see?

In [70]:
#url = get_db_url(username, hostname, password, 'employs')
# misspelled database does not give an error
#url = get_db_url(username, hostname, passwrd, 'employees')
# misspelled variable gives me 'is not defined' error

   b. Intentionally make an error in your SQL query. What does the error message look like?

In [29]:
#pd.read_sql('SELECT * FROM employees LIMIT 5 OSET 50', url)
# misspelling 'offset' on the sql query gives a "Programming Error"

6. Read the employees and titles tables into two separate DataFrames.

In [32]:
employees = pd.read_sql('SELECT * FROM employees', url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [34]:
titles = pd.read_sql('SELECT * FROM titles', url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [39]:
employees.shape, titles.shape
print('employees has', employees.shape, '\nand titles has', titles.shape)

employees has (300024, 6)
and titles has (443308, 4)

8. Display the summary statistics for each DataFrame.

In [43]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [44]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9. How many unique titles are in the titles DataFrame?

In [71]:
pd.unique(titles.title).size

7

10. What is the oldest date in the to_date column?

In [66]:
print(titles.to_date.min())

1985-03-01

11. What is the most recent date in the to_date column?

In [69]:
print(titles.to_date.max())

9999-01-01

In [74]:
#most recent that is not 9999-01-01
print(titles.to_date[titles.to_date != titles.to_date.max()].max())

2002-08-01